<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"fc39701ba83a8e9750ff2787ba8673838d39529e33675ced43d2a40a1815307c","plan_job_ref":"Job Test plan target and replace #420 at https://github.com/dflook/terraform-github-actions/actions/runs/8114469550","plan_out_hash":"781e0389283a6d0ee4d074d0306e3158ecba168527e338cc1b78270c40c8a024","plan_hash":"45138b4e89c7a62a0112633c8cbaa5681d4f1fe8c78e617ceb6ffc069434f005","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "BMusi7mpDH" -> (known after apply)
!~  foreach = "Uno8QpDmjT" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #420](https://github.com/dflook/terraform-github-actions/actions/runs/8114469550)